#+TITLE: Bash Tips


** Script
#+begin_src bash :results output
  while read -r ip; do
      echo $ip
  done <<< $(cat ips.json | jq -r '.[] | select(.id == "/providers/Microsoft.Cdn/edgenodes/Standard_Verizon") | .ipAddressGroups[0].ipv4Addresses[] | [.baseIpAddress,.prefixLength] | @tsv' | sed 's|\t|/|g')
#+end_src

#+RESULTS:
#+begin_example
5.104.64.0/21
46.22.64.0/20
61.221.181.64/26
68.232.32.0/20
72.21.80.0/20
88.194.45.128/26
93.184.208.0/20
101.226.203.0/24
108.161.240.0/20
110.232.176.0/22
117.18.232.0/21
117.103.183.0/24
120.132.137.0/25
121.156.59.224/27
121.189.46.0/23
152.195.0.0/16
180.240.184.0/24
192.16.0.0/18
192.30.0.0/19
192.229.128.0/17
194.255.210.64/26
198.7.16.0/20
203.74.4.64/26
213.64.234.0/26
213.65.58.0/24
68.140.206.0/23
68.130.0.0/17
152.190.247.0/24
65.222.137.0/26
65.222.145.128/26
65.198.79.64/26
65.199.146.192/26
65.200.151.160/27
65.200.157.192/27
68.130.128.0/24
68.130.136.0/21
65.200.46.128/26
213.175.80.0/24
152.199.0.0/16
36.67.255.152/29
194.255.242.160/27
195.67.219.64/27
88.194.47.224/27
203.66.205.0/24
110.164.36.0/24
119.46.85.0/24
49.231.126.0/24
136.228.144.0/24
64.12.0.0/16
#+end_example
0
